Revit 2026 API

# PushButtonAssemblyName Property

---

The assembly path of the button.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AssemblyName { get; set; }
```
```vb
Public Property AssemblyName As String
	Get
	Set
```
```cpp
public:
property String^ AssemblyName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member AssemblyName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when setting the value to . |
| ArgumentException | Thrown when setting the value to an empty string. |
| InvalidOperationException | Thrown when setting the value to a ToggleButton which is not initialized with an external command. |

The path of the assembly which contains the corresponding external command.

#### Reference

PushButton Class

Autodesk.Revit.UI Namespace